#### Terraform Initialization ⚙️: `success`
#### Terraform Validation 🤖: `success`

<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖: `success`

<details><summary>Plan Output</summary>

```terraform
module.main.data.archive_file.lambda_zip: Reading...
module.main.data.archive_file.lambda_zip: Read complete after 0s [id=f0aa89babaa89c82dbde570744254dfe164cbc64]
module.main.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/lapwing-item-news-dev-lambda]
module.main.aws_scheduler_schedule_group.group: Refreshing state... [id=lapwing-item-news-dev-scheduler-group]
module.main.aws_iam_role.lambda_role: Refreshing state... [id=lapwing-item-news-dev-lambda-role]
module.main.aws_ssm_parameter.twitter_credential: Refreshing state... [id=/lapwing-item-news/dev/Twitter/Credential]
module.main.aws_iam_role.scheduler_role: Refreshing state... [id=lapwing-item-news-dev-scheduler-role]
module.main.aws_s3_bucket.bucket: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy]
module.main.aws_lambda_function.lambda_function: Refreshing state... [id=lapwing-item-news-dev-lambda]
module.main.aws_iam_role_policy_attachment.lambda: Refreshing state... [id=lapwing-item-news-dev-lambda-role/arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy]
module.main.aws_iam_policy.scheduler_policy: Refreshing state... [id=arn:aws:iam::087164360110:policy/lapwing-item-news-dev-scheduler-policy]
module.main.aws_scheduler_schedule.invoke_lambda: Refreshing state... [id=lapwing-item-news-dev-scheduler-group/lapwing-item-news-dev-scheduler]
module.main.aws_iam_role_policy_attachment.scheduler: Refreshing state... [id=lapwing-item-news-dev-scheduler-role/arn:aws:iam::087164360110:policy/lapwing-item-news-dev-scheduler-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.main.aws_lambda_permission.allow_scheduler will be created
  + resource "aws_lambda_permission" "allow_scheduler" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "arn:aws:lambda:ap-northeast-1:087164360110:function:lapwing-item-news-dev-lambda"
      + id                  = (known after apply)
      + principal           = "scheduler.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:scheduler:ap-northeast-1:087164360110:schedule/lapwing-item-news-dev-scheduler-group/lapwing-item-news-dev-scheduler"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

If you want to deploy this, please comment the following text.
```
/deploy 18287004058
```